function readValue() {
  var formName = document.getElementById('name-input').value;
  var output = document.getElementById('output');
  
  var sound = "";
  var Text = " لاتوجد نتائج ";
  var name = "";
  var name2 = "";
  var name3 = "";
  var name4 = "";
  var Text2 = "";
  var Text3 = "";
  var img = "";
  var f1="";
  var f2="";
  var f3="";
  var f4="";
  var f5="";
  var f6="";
  var f7="";
  var f8="";
  var f9="";
  var f10="";
  var f11="";
  var f12="";
  var f13="";
  var f14="";
  var img="";
  switch(formName.toLowerCase()) {
    case 'غرير العسل':
      Text="غُرَيْر العَسَل";
       img="h.jpg";
       Text3="غُرَيْر العَسَل  أو غريراء العسل (بالفرنسية: Ratel)أو (بالإنجليزية: Honey Badger) حيوان من جنس الغرير ينتمي إلى فصيلة ابن عرس. يعيش في أفريقيا ومناطق جنوب وغرب آسيا مثل بلوشستان وشرق إيران وجنوب العراق والسعودية و جنوب سلطنة عمان حيث يسمى شعبياً بالضرنبول أو جربوع الخوال وفي محافظة ظفار يسمى محلياً كُور . غرير العسل حيوان لاحم قوي للغاية، وشجاع، و لديه القليل من المفترسات الطبيعية بسبب جلده السميك و قدراته الدفاعية المتوحشة ويهوى أكل عسل النحل البري، ويبدو أنه لا تهمه لسعاته وكذلك يسرق طعام الحيوانات الأخرى الشرسة مثل الأسود الجائعة ويختطف صغار الفهد ويأكل الثعابين السّامة.";
      break;
   
   
    case '':
      Text="لم تقم بكتابة شيء";
      break;
      case 'غزال الريم':
       Text="غزال الريم";
       img="r.jpg";
       Text3="الغزال الدرقي، والذي يعرف أيضا بالغزال الأسود الذيل، الريم كما يسمّيه العرب، والغزال الفارسي هو أحد أنواع الغزلان التي تتواجد في منطقة واسعة من آسيا الوسطى والغربية بما فيها جزء من إيران وجنوب غرب باكستان وصحراء غوبي، بالإضافة لشبه الجزيرة العربية وجنوب غرب آسيا.";
      break;
     case 'الضبع':
       Text="الضبع";
       img="d.jpg";
       Text3="الضبع (الجمع ضِبَاع) هو أي حيوان ينتمي لفصيلة الضَبُعِيّات، من الثدييات التي تلد وترضع صغارها، وهو حيوان مفترس، يخرج للبحث عن طعامه ليلاً منفرداً أو ضمن مجموعة، وهو من الحيوانات التي تعتاش على أكل الجيف وبقايا صيد وفرائس الحيوانات الأخرى، لذا يُعدّ من الحيوانات القمّامة إلا إنه يصيد بمهارة. يتميز بقوة فكيه الهائلة، فتمكنه من سحق العظام بأنيابه، وقيل أن الضبع يصطاد معظم فرائسه بنفسه رغم ما يعرف عنه من أنه آكل للجيف.";
      break;
        case 'المها العربي':
       Text="المها العربي";
       img="m.jpg";
       Text3="المها العربية (الاسم العلمي: Oryx leucoryx) هي إحدى أنواع الظباء، المنتمية لفصيلة البقريات، ذات سنام مميز على كتفيها وقرون طويلة مستقيمة وذيل ينتهي بخصلة شعر. يُعتبر هذا النوع أصغر أنواع المها جميعها، وهو يستوطن صحاري وسهوب شبه الجزيرة العربية وبلاد ما بين النهرين وسوريا وفلسطين ومصر.";
      break;
       case 'النمر العربي':
       Text="النمر العربي";
       img="n.jpg";
       Text3="النمر العربي من الحيوانات الثديية اللاحمة (آكلات اللحوم) والتي تتبع فصيلة السنوريات، وهي إحدى سُلالات النمور. يُعتبر النِمر العربي أكبر وأقوى أنواع القطط العربية، ولكنه يبقى الأصغر حجماً بين سُلالات النمور جميعها، والتي تنتشر في قارتي آسيا وأفريقيا، وتعتبر هذه السلالة مهددة بصورة حرجة عبر موطنها بأكمله الذي يشمل اليوم جنوب سوريا، فلسطين، السعودية، الإمارات، اليمن، وعمان، حيث ان أعدادها مازالت تتناقص شيئا فشيئا.";
      break;
       case 'شبث عربي':
       Text="شبث عربي";
       img="s.jpg";
       Text3="الشبث العربي أو عنكبوت الجمل (الاسم العلمي: Galeodes arabs C. L. Koch) هو نوع عنكبوت كبير نوع ما من جنس الشبث من فصيلة الشبثيات، من رتبة العناكب جملية.";
      break;
       case 'الذئب العربي':
       Text="الذئب العربي";
       img="t.jpg";
       Text3="الذئب العربي (الاسم العلمي: Canis lupus arabs) حيوان من رتبة اللواحم وهو أصغر سلالات الذئب الرمادي والتي كانت تنتشر عبر شبه الجزيرة العربية بكاملها، إلا أنها اليوم تتواجد في بضعة جيوب معزولة في السعودية وتتواجد بقله في جنوب سوريا و فلسطين، والأردن، وبعض أجزاء سيناء على الأرجح. يعود السبب وراء تناقص أعداد هذه الذئاب بشكل كبيرٍ وملحوظٍ في الآونة الأخيرة، إلى الصيد الجائر والملاحقة بالسيارات والقتل العمد لها، إلا أن النشطاء في حماية البيئة وهيئات حماية البيئة قد اثبتت جدارتها بإعادتة لبعض المحميات وجعلة يتكاثر من جديد، إلا أن وضع السلالة ككل لا يزال غير مُطمئن على الإطلاق. تُعرف هذه الحيوانات محليّا في الدول التي تقطنها باسم الذيب أو الديب (جمعها ذياب أو دياب).";
      break;
       case 'القنفذ':
       Text="القنفذ";
       img="q.jpg";
       Text3="القنفذ أو الدعلي (في الإمارات وعُمان) أو الݣنفود (في المغرب) حيوان صغير من الثدييات فهو ينام شتاءً ويستيقظ في الربيع ويعتاش على أكل الحشرات يأكل الديدان والزواحف والفئران الصغيرة وبيض الطيور التي تعشش في البراري كما يأكل النباتات والثمار. يسمى الشوك الذي يعتري جلد القنفذ بالحسك.";
      break;
       case 'الضب':
       Text="الضب";
       img="p.jpg";
       Text3="الضب (الاسم العلمي: Uromastyx)،ويسمى أيضًا السحلية شوكية الذيل. وهو حيوان بيوض يعيش في الصحراء والبراري, شكله الخارجي يكاد يشبه التمساح أو الديناصور عندما ينتصب. يصل طول الضب إلى 85 سم عندما يتمّ نموه. ويعتمد الضب على النبات في غذائه وشرابه فهو لا يشرب الماء إلا نادراً. يؤكد البعض بأن هناك فوائد من أكله, وكذلك توجد فائدة من المعالجة بدمه مؤكدة لدى الكثيرين من البدو.";
      break;
      case '':
       Text="";
       img="r.jpg";
       Text3="";
      break;
          case '':
       Text="";
       img="r.jpg";
       Text3="";
      break;
      case '':
       Text="";
       img="r.jpg";
       Text3="";
      break;
  }
output.innerHTML ='<h1 class="z">' + sound + '</h1>' + '<div class="ui raised segment" id="textbox">' + '<br/>' + '<h3>' + Text + '</h3>' + '<img style="width: 350px; height: auto;" src=" ' + img + ' ">' + '<br/>' + '<br/>' + '<p class="p">' + Text3 + '</p>' + '<p>' + name + '</p>' + '<h3>' +  name4 + '</h3>' + '<h5>' + f1 + '</h5>' + '<h3>' + Text2 + '</h3>' + '<h6>' + name2 + '</h6>' + '<h5 class="aa">' + name3 + '<b class="bc">' + f13 + '</b>' + '</h5>' + '<h5 class="aa" >' + f6 + '</h5>' + '<h5 class="aa">' + f2 + '<b class="bc">' + f13 + '</b>' + '</h5>' + '<h5 class="aa">' + f7 + '</h5>' + '<h5 class="aa">' + f3 + '<b class="bc">' + f13 + '</b>' + '</h5>' + '<h5 class="aa">' + f8 + '</h5>' + '<h5 class="aa">' + f5 + '<b class="bc">' + f13 + '</b>' + '</h5>' + '<h5 class="aa">' + f10 + '</h5>' + '<h5 class="aa">' + f12 + '</h5>' + '<h5 class="aa">' + f4 + '<b class="bc">' + f13 + '</b>' + '</h5>' + '<h5 class="aa">' + f11 + '</h5>' + '<h5 class="aa">' + f9 + '</h5>' + '<p class="p">' + f14 + '</p>' + '</div>';

}