    function readValue() {
      var formName = document.getElementById('name-input').value;
      var output = document.getElementById('output');
      var sound = " لاتوجد نتائج ";
      switch(formName.toLowerCase()) {
        case 'ذرة':
          sound =" ذَرَة : وتسمى أيضا حرة الشرع وهي الجزء الغربي من حرة بني سُلَيم وتعتبر من أقدم المناطق التي يتواجد بها بعض قبائل بني سُلَيم منذ القدم وفيها قُرَى زراعية قديمة ويوجد بها آثار مباني من الحجر وموارد مياه وقد ذكرها بعض المؤرخين ومنهم عَرَّام والحموي "
		  break;
        case 'حرة الشرع':
          sound=" حرة الشرع : وتسمى أيضا ذَرَة وهي الجزء الغربي من حرة بني سُلَيم وتعتبر من أقدم المناطق التي يتواجد بها بعض قبائل بني سُلَيم منذ القدم وفيها قُرَى زراعية قديمة ويوجد بها آثار مباني من الحجر وموارد مياه وقد ذكرها بعض المؤرخين ومنهم عَرَّام والحموي ";
          break;
       
        case '':
          sound="";
          break;
      }
   output.innerHTML = sound;
    }