    function readValue() {
      var formName = document.getElementById('name-input').value;
      var output = document.getElementById('output');
      var sound = " لاتوجد نتائج ";
      switch(formName.toLowerCase()) {
        case 'بني سليم':
          sound=" قبيلة سُلَيْم هي قبيلة قيسية مضرية عدنانية تنسب إلى سُلَيْم بن مَنْصُور بن  بن عكرمة بن خصفة بن قيس عيلان بن مضر بن نزار بن معد بن عدنان ";
          break;
        case 'سليم':
          sound=" الجد سُلَيْم وإليه تنسب قبيلة سليم ";
          break;
       
        case '':
          sound="لم تقم بكتابة شيء";
          break;
		     case '1':
          sound="ليبل يبل يبل يبل يب لبي ليبلي بلي بل يبل يب ليب ليب ل يبل يب ليب ليب ليب ل يب ليب ليب لبي لي بل يب ليب لي بلي بل بيل يب ليب لب يل يبل يب ليب ل يبل يب لي بللتتيبليبليب يبليب ليب ليب ليب ليبل يب ليب ليب لبي لبي ل يبل يب ليب ليب لي بل يبل يب ليب ل لل ل  تلنلسب لي ليب ل يبل بي ليب لي بل يبل يب ليب لبي ل يبل يب ليب لي بل يب ليب ل بيل يبل يب لب يل يبل يب ليب ليب ليب لي بل  ل لللللل ل ل ل ل لل يب ليب لي بلي بل يبل يبل بل بيل يب لبي لبي لبي ل يبل يب لبي ل بي ليب ليب ل بيل يب لبي ليب ل بي لب ل ي ليب لي بل ب بلي بل بي ليب ليب ليب لي بل يب ليب ل    لللللللللل ل ل ل ل ل بي ليب ليب ليب ليب ليب ليب ليب لبي ل بيل يبل يب ليب لي بل يبليب  لل ل ل ل ل  بيبيببيليبليبليبليب  ليبل لللللللل ل ل ل لللللللللللللللل  ل  ل ل ل لللللللللل  لثب ليب ليب ل يبل يبليبليبل يبل يبل يبل يب لبي ليبلي بلي بل يبل يب ليب ليب ل يبل يب ليب ليب ليب ل يب ليب ليب لبي لي بل يب ليب لي بلي بل بيل يب ليب لب يل يبل يبببيليبليبليبليب  ليبل لللللللل ل ل ل لللللللللللللللل  ل  ل ل ل لللللللللل ليبيب ليب ليب ل يبل يب ليب ليب ليب ل يب ليب ليب لبي لي بل يب ليب لي بلي بل بيل يب ليب لب يل يبل يب ليب ل يبل يب لي بللتتيبليبليب يبليب ليب ليب ليب ليبل يب ليب ليب لبي لبي ل يبل يب ليب ليب لي بل يبل يب ليب ل لل ل  تلنلسب لي ليب ل يبل بي ليب لي بل يبل يب ليب لبي ل يبل يب ليب لي بل يب ليب ل بيل يبل يب لب يل يبل يب ليب ليب ليب لي بل  ل لللللل ل ل ل ل لل يب ليب لي بلي بل يبل يبل بل بيل يب لبي لبي لبي ل يبل يب لبي ل بي ليب ليب ل بيل يب لبي ليب ل بي لب ل ي ليب لي بل ب بلي بل بي ليب ليب ليب لي بل يب ليب ل    لللللللللل ل ل ل ل ل بي ليب ليب ليب ليب ليب ليب ليب لبي ل بيل يبل يب ليب لي بل يبليب  لل ل ل ل ل  بيبيببيليبليبليبليب  ليبل لللللللل ل ل ل لللللللللللللللل  ل  ل ل ل لللللللللل  لثب ليب ليب ل يبل يبليبليبل يبل يبل يبل يب لبي ليبلي بلي بل يبل يب ليب ليب ل يبل يب ليب ليب ليب ل يب ليب ليب لبي لي بل يب ليب لي بلي بل بيل يب ليب لب يل يبل يبببيليبليبليبليب  ليبل لللللللل ل ل ل لللللللللللللللل  ل  ل ل ل لللللللللل ليب ل يبل يب لي  ل يبل يب لي بل يب ليب ليب ل يبل يب ليب ليب ليب ل يب ليب ليب لبي لي بل يب ليب لي بلي بل بيل يب ليب لب يل يبل يب ليب ل يبل يب لي بللتتيبليبليب يبليب ليب ليب ليب ليبل يب ليب ليب لبي لبي ل يبل يب ليب ليب لي بل يبل يب ليب ل لل ل  تلنلسب لي ليب ل يبل بي ليب لي بل يبل يب ليب لبي ل يبل يب ليب لي بل يب ليب ل بيل يبل يب لب يل يبل يب ليب ليب ليب لي بل  ل لللللل ل ل ل ل لل يب ليب لي بلي بل يبل يبل بل بيل يب لبي لبي لبي ل يبل يب لبي ل بي ليب ليب ل بيل يب لبي ليب ل بي لب ل ي ليب لي بل ب بلي بل بي ليب ليب ليب لي بل يب ليب ل    لللللللللل ل ل ل ل ل بي ليب ليب ليب ليب ليب ليب ليب لبي ل بيل يبل يب ليب لي بل يبليب  لل ل ل ل ل  بيبيببيليبليبليبليب  ليبل لللللللل ل ل ل لللللللللللللللل  ل  ل ل ل لللللللللل  لثب ليب ليب ل يبل يبليبليبل يبل يبل يبل يب لبي ليبلي بلي بل يبل يب ليب ليب ل يبل يب ليب ليب ليب ل يب ليب ليب لبي لي بل يب ليب لي بلي بل بيل يب ليب لب يل يبل يبببيليبليبليبليب  ليبل لللللللل ل ل ل لللللللللللللللل  ل  ل ل ل لللللللللل ليب ل يبل يب لي  لثب ليب ليب ل يبل يبليب";
		 break;
      }
   output.innerHTML = sound;
    }